{
  "type":"text",
  "data":"<h2>Basics of Islam &ndash; Study Resources<\/h2><p><span lang=\"\\&quot;en-US\\&quot;\">A basic study of Islam is necessary for understanding current discussions on Islam, Science, and Technology. For Muslims, the study of the basics of Islam is also personally obligatory on religious grounds. The efforts of classical Islamic Scholars have led to the development of various distinct disciplines within the Islamic knowledge tradition. Some of the main disciplines are: Fiqh (Sacred Law), Tafsir (Quranic Interpretation), Hadith (Prophetic Narrations), Aqida (Islamic Theology), and Tasawwuf (Islamic Spirituality or Sufism). <\/span><\/p><p><span lang=\"\\&quot;en-US\\&quot;\">For Sunni Muslims, who form the majority of Muslims, there are four schools of Fiqh (Islamic Sacred Law). These are: Hanafi, Shafi&rsquo;i, Maliki, and Hanbali schools, named after their original founders. In Aqida (Islamic Theology) the Ash&rsquo;ari, Matureedi, and Hanbali schools represent the beliefs of the <\/span><\/p><p><span lang=\"\\&quot;en-US\\&quot;\">Sunni majority. The differences between these three schools of Aqida are only in matters of terminology or minor secondary points of belief. Ash&rsquo;ari and Matureedi schools have historically played a great role in defending Islamic beliefs through rational arguments. Hence, these two are more widely known and studied. Although Tasawwuf (Islamic Spirituality or Sufism) also has classical books on the subject, it is of a more practical nature compared to other disciplines. True Islamic spirituality or true Sufism is distinct from fake versions in the strong emphasis that it gives in adhering to Islamic law and beliefs as specified by the above schools of Fiqh and Aqida. <\/span><\/p><p><span lang=\"\\&quot;en-US\\&quot;\">Although offline study is always recommended for Islamic knowledge, online resources are also available today. Online resources are useful in cases where offline study is not possible. Some online resources are listed below:<\/span><\/p><ul><li><p><span lang=\"\\&quot;en-US\\&quot;\"><strong><a class=\"anchor\" href=\"https:\/\/academy.seekersguidance.org\/local\/track\/?id=39\">SeekersGuidance<\/a><\/strong><\/span><\/p><\/li><\/ul><p><span lang=\"\\&quot;en-US\\&quot;\">The Islamic Studies Curriculum on SeekersGuidance provides free courses that teach traditional Islamic books from basic to advanced levels. The courses are organized systematically into five levels. In Fiqh, Hanafi and Shafi&rsquo;i tracks are available. Aqida courses focus on the Ash&rsquo;ari tradition. Tafsir and Hadith courses are also included. Texts on Tasawwuf are also taught. SeekersGuidance was founded by Shaykh Faraz Rabbani. <\/span><\/p><ul><li><p><span lang=\"\\&quot;en-US\\&quot;\"><strong><a class=\"anchor\" href=\"https:\/\/lote.org.uk\/\">Lote Tree Foundation<\/a><\/strong><\/span><\/p><\/li><\/ul><p><span lang=\"\\&quot;en-US\\&quot;\">Free courses are available on Hanafi, Shafi&rsquo;I, and Maliki Fiqh. Aqida, Tasawwuf, and other courses are also available. <\/span><\/p><ul><li><p><span lang=\"\\&quot;en-US\\&quot;\"><strong>Arkview &ndash; Safina Society<\/strong><\/span><\/p><\/li><\/ul><p><span lang=\"\\&quot;en-US\\&quot;\">Founded by Shaykh Dr. Sadee Elmasry, the online institute provides courses to study Islam from basic to advanced levels. Courses are available on all four schools of Fiqh. Aqida, Tafsir, and Tasawwuf. Other subjects are also available. <\/span><\/p><ul><li><p><span lang=\"\\&quot;en-US\\&quot;\"><strong>Open Madrasa<\/strong><\/span><\/p><\/li><\/ul><p><span lang=\"\\&quot;en-US\\&quot;\">Founded by Shaykh Shams Tameez, Open Madrasa offers courses on Matureedi theology. A basic-level course on Hanbali theology is also available. <\/span><\/p><ul><li><p><span lang=\"\\&quot;en-US\\&quot;\"><strong><a class=\"anchor\" href=\"https:\/\/www.albalaghacademy.org\/course\/al-balagh-online-alimiyyah-programmes\/?utm_source=Website&amp;utm_medium=CoursesbyIT&amp;utm_campaign=ALM+24\">Al Balagh Academy<\/a><\/strong><\/span><\/p><\/li><\/ul><p><span lang=\"\\&quot;en-US\\&quot;\">The Alimiyyah course on Al Balagh follows the traditional Darse-Nizami syllabus in four levels. <\/span><\/p><ul><li><p><span lang=\"\\&quot;en-US\\&quot;\"><strong><a class=\"anchor\" href=\"https:\/\/www.theqalamacademy.com\/adults\/foundations-associate-certificate\">Qalam Academy<\/a><\/strong><\/span><\/p><\/li><\/ul><p><span lang=\"\\&quot;en-US\\&quot;\">Their Associates Certificate in Foundational Islamic Studies provides individuals with a firm Islamic foundation. <\/span><\/p><p><span lang=\"\\&quot;en-US\\&quot;\">Numerous other resources are available. The above list is only an example. <\/span><\/p>"
}
