{
    "type":"text",
    "data":"<p><span lang="en-US"><strong>Dr. Shoaib Malik&rsquo;s Famous Work:</strong></span></p><p><span lang="en-US">In 2021, Dr. Shoaib Malik published his famous book &lsquo;Islam and Evolution: Al-Ghazālī and the Modern Evolutionary Paradigm' which served as a major turning point in discussions on Islam &amp; Evolution. The book compares the various viewpoints regarding Islam &amp; Evolution and provides a detailed analysis based on traditional Islamic theology (Ash&rsquo;ari tradition) as represented by Imam Ghazali. The book sparked further discussions on Islam &amp; Evolution in particular and on Islam &amp; Science in general. Several other books, articles, courses, and videos have emerged after Dr. Shoaib&rsquo;s book which were directly or indirectly influenced by his work. </span></p><p><span lang="en-US">Dr. Shoaib Malik classifies perspectives on Islam and evolution into four categories: Creationism, Human Exceptionalism, Adamic Exceptionalism, and No Exceptions.</span></p><p><span lang="en-US">C</span>reationism<span lang="en-US"> is the idea that no creature was created through the evolutionary process. </span></p><p><span lang="en-US">Human exceptionalism permits non-human evolution, but believes Adam (a.s.) and humanity are not a product of evolution. In this perspective, humans are completely excluded from the evolutionary process and have no direct link to other species. </span></p><p><img src="file:///tmp/lu6309120q5.tmp/lu6309120q8_tmp_39992a43.png" alt="" width="562" height="339" name="Image4" border="0" /></p><p><span lang="en-US"><strong>Figure.</strong></span><span lang="en-US"> Human Exceptionalism and Adamic Exceptionalism compared. </span></p><p><span lang="en-US">Adamic exceptionalism is the idea that non-humans and early hominids are a product of evolution, but only Adam (a.s) is an exception to that process. This perspective implies that some early or later descendants of Adam (a.s.) had offspring from non-Adamic hominids. These non-Adamic hominids would have been created through evolution prior to Adam (a.s.). As a result, this perspective would imply that modern-day humans have a miraculous beginning through the special creation of Adam (a.s.), while also having a link to the evolutionary process through non-Adamic hominid ancestors (who were created through the evolutionary process). </span></p><p><span lang="en-US">T</span>he <span lang="en-US">N</span>o <span lang="en-US">E</span>xceptions stance is the position that there are no exemptions from the <span lang="en-US">evolutionary </span>process. <span lang="en-US">This perspective would mean that</span> non-humans, h<span lang="en-US">ominids</span>, Adam<span lang="en-US"> (a.s.), and all modern humans </span>are products of evolutionary processes.<span lang="en-US"> This would also imply that Adam (a.s.) had parents. The No Exceptions perspective is clearly against Islamic teachings as the special creation of Adam (a.s.) without parents is clearly mentioned in the Quran. </span></p><p><span lang="en-US">Shaykh Nuh Keller writes in his separate article titled &lsquo;</span>Islam and Evolution a letter to Suleman Ali<span lang="en-US">&rsquo;: &ldquo;As for claim that man has evolved from a non-human species, this is unbelief (kufr) no matter if we ascribe the process to Allah or to "nature," because it negates the truth of Adam's special creation that Allah has revealed in the Qur'an. Man is of special origin, attested to not only by revelation, but also by the divine secret within him, the capacity for ma'rifa or knowledge of the Divine that he alone of all things possesses. By his God-given nature, man stands before a door opening onto infinitude that no other creature in the universe can aspire to. Man is something else.&rdquo;</span></p><p><span lang="en-US"><strong>Table.</strong></span><span lang="en-US"> The four classifications.</span></p><p><img src="file:///tmp/lu6309120q5.tmp/lu6309120q8_tmp_4d33c2b9.png" alt="" width="594" height="147" name="Image5" border="0" /></p><p><span lang="en-US">Dr. Shoaib Malik then discussed six metaphysical concerns related to evolution in detail. These six concerns are: Naturalism, Chance, Inefficiency, Intelligent Design, Evil and Suffering, and Objective Morality. Dr. Shoaib Malik showed that from a metaphysical perspective, Imam Ghazālī&rsquo;s Ashʿarite framework is entirely compatible with evolution. The Ash&rsquo;ari school has clear responses to the above concerns and none of them pose real issues. </span></p><p><span lang="en-US">Dr. Shoaib Malik then goes into a detailed discussion on the hermeneutical aspects of the discussion on Islam &amp; Evolution. He discusses the different hermeneutic arguments that have been used for and against evolution. He shows that these arguments for and against the evolution of non-Adamic creatures were found to be wanting. </span>The most important Qurʾān verse in the entire discussion is Qurʾān 3:59, <span lang="en-US">which mentions </span>the similitude of Jesus<span lang="en-US"> (a.s.) </span>and Adam<span lang="en-US"> (a.s.). This verse does not allow the attribution of parents </span>to Adam<span lang="en-US"> (a.s.), thus effectively showing that Adam (a.s.) was not created through evolution. </span></p><p><span lang="en-US">Dr. Shoaib Malik finally concludes that Imam </span>Ghazālī&rsquo;s framework is hermeneutically compatible with <span lang="en-US">C</span>reationism, <span lang="en-US">H</span>uman <span lang="en-US">E</span>xceptionalism, and Adamic <span lang="en-US">E</span>xceptionalism but not with <span lang="en-US">N</span>o <span lang="en-US">E</span>xceptions.<span lang="en-US"> From a metaphysical perspective, Imam Ghazālī&rsquo;s Ashʿarite framework is compatible with all four categories. However, from a hermeneutical perspective, the No Exceptions category has to be rejected. </span></p><p><span lang="en-US">Dr. Shoaib Malik also lists the major Islamic Scholars and Thinkers who have previously put forward and supported these different categories. He lists Dr. Zakir Naik, Prof. Osman Bakar, Seyyed Hossein Nasr, and Shaykh Muḥammad Saʿīd Ramaḍān Al-Būṭī as some supporters of Creationism. Shaykh Nuh Ha Mim Keller, Dr. Yasir Qadhi, and Dr. Nazir Khan are listed by him as those who supported Human Exceptionalism. Dr. David Solomon Jalajel is uniquely listed as the proponent of Adamic Exceptionalism. </span></p><p><span lang="en-US"><strong>Shaykh Dr. Rafaqat Rashid&rsquo;s Contribution:</strong></span></p><p><span lang="en-US">Several developments have occurred after Dr. Shoaib&rsquo;s publication of his book. One very important publication is Shaykh Dr. Rafaqat Rashid&rsquo;s book &lsquo;Exploring Tawaqquf in Islamic Theology: Navigating Belief Obligations, Adamic Exceptionalism, and Application Challenges&rsquo;. Shaykh Rafaqat Rashid rigorously examines the theological concept of tawaqquf, or non-commitment, within the framework of Islamic theology, with a specific focus on its implications for Adamic Exceptionalism. </span></p><p><span lang="en-US">Shaykh Dr. Rafaqat Rashid focuses on the concept of &lsquo;Nafsin Wahida&rsquo; mentioned in Quran (4:1). He discusses the issue of multiple lineages for humans and human uniqueness. He also delves into the question &ldquo;what is the essential component defining humanity? Is it the human soul? Or both human soul and body?&rdquo;. He also discusses whether the original covenant taken from the progeny of Adam (a.s.) (Q. 17:172) was taken with soul and body together. He includes a discussion on non-critical and critical attributes that make up humans. </span></p><p><img src="file:///tmp/lu6309120q5.tmp/lu6309120q8_tmp_5b5b32fe.png" alt="" width="365" height="314" name="Image6" border="0" /></p><p><span lang="en-US"><strong>Figure.</strong></span><span lang="en-US"> Descent of critical and non-critical components. </span></p><p><span lang="en-US">His discussions are based on classical Tafsirs and classical Islamic works, particularly on Imam Razi&rsquo;s work. He concludes that Adamic Exceptionalism has to be rejected as it goes against certain positions supported by classical Sunni Scholars. </span></p><p><span lang="en-US">He writes: </span></p><p>&ldquo;<span lang="en-US">The verse from the Qur'ān, "O men, fear your Lord who created you from a nafsin wāḥidah (single soul), and from it created its match, and spread many men and women from the two ..." (Q. 4:1), stands as a significant point of reference in discussions concerning Adamic exceptionalism. Although this verse's wording may not be unequivocally explicit (naṣṣ), leaving room for interpretation (taʿwīl), early Islamic scholars (salaf) and their successors reached a consensus (ijmāʿ) on its interpretation. They understood this verse to denote the descent of all humans from Ādam, excluding the possibility of shared lineage with other beings.</span></p><p>Muslim scholars have historically interpreted these verses as indicating a singular human lineage, dismissing the notion of multiple lineages with distinct origins. Thus, to adopt a stance of <em>tawaqquf </em>(non-commitment) on an issue that the <em>Ahl al-Sunnah w&rsquo;al-Jamāʿah </em>considers obligatory to accept as the sole permissible position may be deemed a form of innovation (<em>bidʿa</em>). This form of <em>tawaqquf</em>, referred to as <em>al-tawaqquf al-bidʿī</em>, is contentious within the community, as consensus has been established on the matter, leading some authorities to denounce deviation from this consensus as heresy.<span lang="en-US">&rdquo; </span></p><p><span lang="en-US"><strong>Other Recent Works:</strong></span></p><p><span lang="en-US">Another important discussion that has recently occurred is the relation between the term &lsquo;human&rsquo; and the Homo sapiens species. Dr. Shoaib Malik recently responded to a criticism regarding his book in this regard. The use of the terms &lsquo;theological humans&rsquo; and &lsquo;biological humans&rsquo; were found to be useful in reducing the confusion in this regard. </span></p><p><span lang="en-US">Dr. Shoaib Malik writes in his article &lsquo;Defending &lsquo;Islam and Evolution: Al-Ghazālī and the Modern Evolutionary Paradigm&rsquo;: Abrahamic Dialogues and Interdisciplinary Insights&rsquo;: </span></p><p>&ldquo;<span lang="en-US">In Islamic scripture, we have theological terms that are used to address &ldquo;humans,&rdquo; which include insān, bashar, and banī Adam. In evolutionary biology, we have terms for a variety of hominins such as Homo sapiens, Homo neanderthalensis, Homo denisova, and Homo erectus, among others &hellip;. The obvious question is: How do these disciplinary terminol- ogies correlate with one another? Does the theological category encompass a subcategory of Homo sapiens? Is it the entire set of Homo sapiens? Or is it a broader category than Homo sapiens and a subcategory of Homo. </span></p><p><span lang="en-US">From the lens of Islamic theology, this answer is undeterminable, and thus, we must resort to theological non-commitment (tawaqquf). All are metaphysically possible and scripturally indeterminable.&rdquo; </span></p><p><img src="file:///tmp/lu6309120q5.tmp/lu6309120q8_tmp_b138ebb7.png" alt="" width="672" height="209" name="Image7" border="0" /></p><p><span lang="en-US"><strong>Figure.</strong></span><span lang="en-US"> Various possibilities for correlating theological humans (i.e. Bani Adam) with biological humans (i.e. Homo Sapiens). </span></p><p><span lang="en-US">Publications have also explored various other aspects related to Islam &amp; Evolution. This includes discussions on whether the flood during the period Nuh (a.s.) was a global or local event, Shi&rsquo;i views on evolution, etc. </span></p><p><span lang="en-US">One important point regarding the theory of evolution (also applicable to many other theories in science) is that all change in the world is directly created by Allah. &lsquo;Natural laws&rsquo; or &lsquo;Nature&rsquo; does not have any power of its own to create or cause anything. Hence, even if evolution is true for some non-human species, Allah is still their creator and not &lsquo;Nature&rsquo;. &lsquo;Random mutations&rsquo; are often mentioned with respect to evolution. However, nothing is random for Allah. Everything in the world is directly created by Allah in a well-planned manner. </span></p><p><span lang="en-US">Shaykh Nuh Keller highlights in his article &lsquo;</span>Islam and Evolution a letter to Suleman Ali<span lang="en-US">&rsquo;: </span></p><p>&ldquo;<span lang="en-US">Allah alone is Master of Existence. He alone causes all that is to be and not to be. Causes are without effect in themselves, but rather both cause and effect are created by Him. The causes and the effects of all processes, including those through which plant and animal species are individuated, are His work alone. To ascribe efficacy to anything but His action, whether believing that causes (a) bring about effects in and of themselves; or (b) bring about effects in and of themselves through a capacity Allah has placed in them, is to ascribe associates to Allah (shirk). Such beliefs seem to be entailed in the literal understanding of "natural selection" and "random mutation," and other evolutionary concepts, unless we understand these processes as figurative causes, while realizing that Allah alone is the agent. This is apart from the consideration of whether they are true or not.&rdquo;</span></p><p><span lang="en-US"><strong>Resources:</strong></span></p><ul><li><p><span lang="en-US">Dr. Shoaib Malik, Islam and Evolution: Al-Ghazālī and the Modern Evolutionary Paradigm (</span><span data-darkreader-inline-color=""><u><a href="https://www.taylorfrancis.com/books/oa-mono/10.4324/9780429345753/islam-evolution-shoaib-ahmed-malik"><span lang="en-US">https://www.taylorfrancis.com/books/oa-mono/10.4324/9780429345753/islam-evolution-shoaib-ahmed-malik</span></a></u></span><span lang="en-US">)</span></p></li><li><p><span lang="en-US">Shaykh Dr. Rafaqat Rashid, Exploring Tawaqquf in Islamic Theology: Navigating Belief Obligations, Adamic Exceptionalism, and Application Challenges (</span><span data-darkreader-inline-color=""><u><a href="https://www.academia.edu/116150714/Exploring_Tawaqquf_In_Islamic_Theology?source=swp_share"><span lang="en-US">https://www.academia.edu/116150714/Exploring_Tawaqquf_In_Islamic_Theology?source=swp_share</span></a></u></span><span lang="en-US">)</span></p></li><li><p><span lang="en-US">Shaykh Nuh Keller, </span>Islam and Evolution a letter to Suleman Ali<span lang="en-US"> (</span><span data-darkreader-inline-color=""><u><a href="https://www.masud.co.uk/ISLAM/nuh/evolve.htm"><span lang="en-US">https://www.masud.co.uk/ISLAM/nuh/evolve.htm</span></a></u></span><span lang="en-US">)</span></p></li><li><p><span lang="en-US">Dr. Shoaib Malik, Is Evolution Even Possible in Islamic Thought? (</span><span data-darkreader-inline-color=""><u><a href="https://www.theo-puzzles.ac.uk/2022/05/02/malik2/"><span lang="en-US">https://www.theo-puzzles.ac.uk/2022/05/02/malik2/</span></a></u></span><span lang="en-US">)</span></p></li><li><p><span data-darkreader-inline-color=""><span lang="en-US">Dr. David Solomon Jalajel, </span></span><span data-darkreader-inline-color="">Tawaqquf and Acceptance of Human Evolution</span><span data-darkreader-inline-color=""><span lang="en-US"> (</span></span><span data-darkreader-inline-color=""><u><a href="https://yaqeeninstitute.org/read/paper/tawaqquf-and-acceptance-of-human-evolution"><span lang="en-US">https://yaqeeninstitute.org/read/paper/tawaqquf-and-acceptance-of-human-evolution</span></a></u></span><span data-darkreader-inline-color=""><span lang="en-US">)</span></span></p></li><li><p><span lang="en-US">Dr. Shoaib Malik, </span>Defending &lsquo;<em>Islam and Evolution: Al-Ghazālī and the Modern Evolutionary Paradigm</em>': Abrahamic Dialogues and Interdisciplinary Insights<span lang="en-US">. (</span><span data-darkreader-inline-color=""><u><a href="https://www.tandfonline.com/doi/abs/10.1080/14746700.2023.2255955"><span lang="en-US">https://www.tandfonline.com/doi/abs/10.1080/14746700.2023.2255955</span></a></u></span><span lang="en-US">)</span></p></li><li><p><span lang="en-US">Dr. Nazif Khan and Dr. Yasir Qadhi, </span>Human Origins : Theological Conclusions and Empirical Limitations<span lang="en-US"> (</span><span data-darkreader-inline-color=""><u><a href="https://yaqeeninstitute.org/wp-content/uploads/2018/08/Human-Origins_-Theological-Conclusions-and-Empirical-Limitations.pdf"><span lang="en-US">https://yaqeeninstitute.org/wp-content/uploads/2018/08/Human-Origins_-Theological-Conclusions-and-Empirical-Limitations.pdf</span></a></u></span><span lang="en-US">)</span></p></li><li><p>Edited By <span lang="en-US">Dr. </span>Shoaib Ahmed Malik, <span lang="en-US">Dr. </span>David Solomon Jalajel<span lang="en-US">, New Frontiers in Islam and Evolution: Scriptures, Scholars, and Societies (</span><span data-darkreader-inline-color=""><u><a href="https://www.routledge.com/New-Frontiers-in-Islam-and-Evolution-Scriptures-Scholars-and-Societies/Malik-Jalajel/p/book/9781032429274"><span lang="en-US">https://www.routledge.com/New-Frontiers-in-Islam-and-Evolution-Scriptures-Scholars-and-Societies/Malik-Jalajel/p/book/9781032429274</span></a></u></span><span lang="en-US">)</span></p></li><li><p><span lang="en-US">Tahseen N. Khan, The Provenance of Man: A Sunni Apologetic of The Original Creation Of Adam ('Alayh Al-Salam) (</span><span data-darkreader-inline-color=""><u><a href="https://www.philasuficalpublications.com/"><span lang="en-US">https://www.philasuficalpublications.com/</span></a></u></span><span lang="en-US">)</span></p></li></ul>"
}
