{
    "type":"text",
    "data":"<p>Dr. Safaruk Chowdhury studied Philosophy at Kings College London, completing it with the accompanying Associate of Kings College (AKC) award. He then travelled to Cairo to study the traditional Islamic Studies curricula at al-Azhar University. He returned to the UK to complete his MA at the School of Oriental and African Studies, University of London with distinction. His doctoral dissertation was on the eminent Sufi hagiographer and theoretician Abu 'Abd al-Rahman al-Sulami (d. 412/1021), published as <em>A Sufi Apologist of Nishapur: The Life and Thought of Abu 'Abd al-Rahman al-Sulami</em> (Sheffield: Equinox Publishing, 2019).</p><p>He has published numerous academic articles in the fields of Islamic philosophy and theology focusing on ethics, metaphysics, logic and epistemology. His most recent book is <em>Islamic Theology and the Problem of Evil</em> (New York and Cairo: AUC Press, 2021), which is the first work in Islamic Studies to treat the topic within the analytic theology approach. Chowdhury was the lead researcher on the project <em>Beyond Foundationalism: New Horizons in Muslim Analytic Theology</em>, funded under a John Templeton Foundation grant award in association with Cambridge Muslim College and Aziz Foundation, exploring new vistas in Islamic epistemology.</p><p>Dr. Chowdhury is a past lecturer at the School of Oriental and African Studies, University of London and Birkbeck, University of London. He runs the Islamic Analytic Theology website, and his academic work can be found on his Academia.edu page. He is currently a lecturer and researcher at the Ibn Rushd Centre for Excellence and Research, a senior instructor at the Whitethread Institute, executive editor of the Journal of Islamic Philosophy and chair of the Islamic Literary Society.</p><p>Ustadh Safaruk has very good knowledge in philosophical aspects including Philosophy of Science, Philosophy of Technology, Consciousness and AI etc. His course on Whitethread Institute covers a good deal on the basics of Islam &amp; Science.</p>"
}
