{
    "type":"text",
    "data":"<p>Shaykh Dr Rafaqat Rashid is a traditional Islamic Scholar scholar, General Practitoner (Medical Doctor) and an international professional trainer and educator. He is the co-founder of al-Balagh Academy and Course Director of many of its courses in particular its popular international medical fiqh programmes, which have had hundreds of registered students around the world, and associated takhassus courses for ulama. Al-Balagh Academy also offers a variety of courses related to Islam &amp; Science.</p><p>He has been a senior lecturer at JKN Institute for over a decade whilst having been given the responsibility for developing and leading the delivery of the advanced Dars al-Nizami course in Arabic/ English for the new generation of Ulama at both Al Balagh Academy and JKN Institute in Bradford, UK.</p><p>He has been involved with the JKN Fatawa department and other organisations responding to queries related to medical fiqh and bioethics for over a decade under the guidance of Shaykh Mufti Saiful Islam and other Shariah scholars, having undergone continuous and ongoing training by them in Ifta&rsquo; and contributing to the collection of medical fatawa published by the JKN Fatawa department as well as leading on the Islamic medical ethics research conducted by the Shariah department of Al Balagh Academy.</p><p>He is an academic in the field of Islamic bioethics and medical law having obtained his Masters from the University of Manchester on the subject of Muslim scholarly debates on the issue of Organ Transplantation , and also holding the title of honorary lecturer at the university of Leeds. He has contributed to academic peer-reviewed chapters in volumes and journal articles on the topics of Islamic Bioethics and Islamic Medical Jurisprudence and continues to contribute to these at an international level.</p><p>Shaykh Dr Rafaqat has been given ijaza from a number of muslim scholars from the UK and abroad. He has been involved in training Ulema, students and the general public for a number of years. He currently teaches and has taught Hadith (Sahih Muslim, Sahih Bukhari, Sunan Nasai, Mishkaat al-Masaabih with its sharh Mirqaat), Tafsir (Jalaalayn, Tafsir al-Qurtubi, Ruh al-Ma&rsquo;ani and many others), Usūl al-Tafsir (al-Itqaan, al-Fawz al-Kabir), Usul al-Hadith (Nuzhat al-Nazr Sharh Nukhbat al-Fikr), Sharh Ma&rsquo;āni al-Aathār of Imām Tahāwi, Balāgha, Mantiq (al-Mirqaat), Arabic Grammar and in particular his main area of interest and expertise, Usūl al-Fiqh.</p><p>&bull; <a class=\"anchor\" href=\"https://youtu.be/7KQ5Bqy5ZpY?si=7e_qWRoXw4uGUKxE\">Video, Scientism and Science Denial</a></p>"
}
