{
    "type":"text",
    "data":"<p>Dr. Sohaib Saeed is the founder and director (since 2017) of Ibn &lsquo;Ashur Centre. The center based in Scotland, UK, aims to serve the global field of Quranic Studies through innovative research, authoritative publications, constructive partnerships, specialist consultancy, authentic education and scholarly training. After a BA and MSc in philosophy (Edinburgh), Dr. Sohaib Saeed graduated from Al-Azhar (Faculty of Theology, Cairo) in Tafsīr and Quranic Sciences. He then completed his PhD at SOAS, University of London, under the supervision of the renowned Quran translator M.A.S. Abdel Haleem; the book based on his thesis is forthcoming from Edinburgh University Press: <em>Explaining the Qur&rsquo;an Through the Qur&rsquo;an</em>.</p><p>Dr. Sohaib is well known for his translations of classical works of tafsīr. The first volume of The Great Exegesis by Imam Razi was a recipient of the Sheikh Hamad Award for Translation in 2018, further volumes are expected to follow from Ibn &lsquo;Ashur Centre. He has also written for academic journals and collections including the <em>Journal of Qur&rsquo;anic Studies</em>, the <em>Encyclopaedia of the Qur&rsquo;an</em> (Brill Online) and <em>The Handbook of Qur&rsquo;anic Hermeneutics</em> (De Gruyter). He wrote reviews of around 20 translations for the blog of the Global Qur&rsquo;an (Freiburg) while working in this ERC-funded project as a postdoctoral researcher. He has also reviewed submissions to the Journal of the American Academy of Religion, the Journal of Islamic Studies and others, and is an advisory board member for Edinburgh Studies in Islamic Scripture &amp; Theology (EUP book series).</p><p>In terms of educational projects, Dr. Sohaib has a long track record of contribution and leadership. Since 2016, he has been the senior tafsīr consultant for Bayyinah Institute, which now benefits from the broader team at Ibn &lsquo;Ashur Centre. In 2021, he took on a key responsibility at Quran.Foundation, overseeing content and quality at the major website Quran.com and its sister site QuranReflect. Through an earlier initiative called Quranica, he created innovative events and films presenting the Quran through the art of recitation &ndash; including <em>Solomon &amp; the Queen</em> and <em>Father &amp; Son: The Wisdom of Luqman</em>.</p><p>His teaching experience includes the Universities of Glasgow and Edinburgh, as well as community institutions such as Al-Salam Institute, iSyllabus, the Islamic Seminary of America, and Whitethread Institute, and he continues to accept speaking invitations as well as presenting at academic conferences in the field of Quranic Studies.</p><p>He has also contributed to discussions on the topic Quran &amp; Scientific Miracles.</p>"
}
