{
    "type":"text",
    "data":"<p>Shaykh Faraz A. Khan is a scholar of Ashʿari and Maturidi philosophical theology with field specialties in Hanafi Jurisprudence, Prophetic Biography, Hadith, and Logic. He is currently at Zaytuna College, where he has taught Kalam Theology, Creedal Theology, Prophetic Biography, Readings in Muslim Spirituality, and Logic in the Islamic Tradition. Shaykh Faraz also serves as the coordinator of the Honors Program at Zaytuna College, in which he has taught additional seminars on classical Islamic texts. His research interests center on the engagement of philosophical theology and ethics with the contemporary age.</p><p>After completing undergraduate studies at the University of Texas at Austin, he moved to Amman, Jordan, in 2004 and read classical texts with distinguished scholars in Ashʿari and Maturidi scholastic theology, Hanafi jurisprudence, prophetic narration, logic, and other religious sciences, receiving scholarly authorization (ijazah) after seven years of full-time study. His teachers include Shaykh Ahmad al-Jammal, Shaykh Abdul Qadir al-Ani, Shaykh Akram Abdul Wahhab, Dr. Ashraf Muneeb, Dr. Salah Abu &rsquo;l-Hajj, Shaykh Faraz Rabbani, Shaykh Bilal Najjar, Shaykh Hamza al-Bakri, and Shaykh Naeem Abdul Wali.</p><p>Shaykh Faraz&rsquo;s most recent book, <em>An Introduction to Islamic Theology: Imam Nūr al-Dīn al-Sābūnī&rsquo;s Al-Bidāyah fī usūl al-dīn</em>, was published under the Zaytuna College Curriculum Series in 2020. In the work, he translates and annotates a manual on Maturidi theology authored by Imam Nūr al-Dīn al-Ṣābūnī (d. 580/1184), a prominent Muslim theologian from Bukhara, which provides a foundation upon which modern Muslim discourse can be built. The text explains the central tenets of the Islamic creed and refutes erroneous positions of alternative theologies. Shaykh Faraz also translated and annotated the classical Hanafi primer <em>Ascent to Felicity (Maraqi &lsquo;l-Sa`adat)</em> by Imam Shurunbulali.</p><p>Shaykh Faraz has published an excellent article on Consciousness and Materialism. He also discusses it in a video.</p>"
}
